cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# packages
brew 'wget'
brew 'openssl'
brew 'hub'
brew 'zsh'

brew 'ruby-build'
brew 'rbenv'
brew 'python'
brew 'go'
brew 'node'
brew 'yarn'

brew 'imagemagick'
brew 'readline'
brew 'nginx'
brew 'postgresql'
brew 'redis'
brew 'mongodb'

# apps
cask '1password'
cask 'lastpass'

cask 'iterm2'
cask 'paw'
cask 'mongodb-compass'
cask 'pgadmin4'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'rowanj-gitx'
cask 'github-desktop'
cask 'wechatwebdevtools'
cask 'android-studio'
cask 'alfred'
cask 'daisydisk'
cask 'dash'
cask 'sketch-tool'

cask 'slack'
cask 'firefox'
cask 'google-chrome'
cask 'google-photos-backup-and-sync'
cask 'google-cloud-sdk'
cask 'dropbox'
cask 'evernote'
cask 'handbrake'
cask 'bittorrent'
cask 'the-unarchiver'
cask 'welly'
cask 'skype'
cask 'mplayerx'
cask 'vlc'
cask 'scroll-reverser'
cask 'spotify'
cask 'keyboardcleantool'